To install Pandas, you can use "pip install pandas"

In [1]:
import warnings
warnings.filterwarnings("ignore")

In [2]:
import pandas as pd # Let's import pandas with pd
pd.__version__ # To print the installed version pandas

'2.2.3'

SERIES

In [3]:
obj=pd.Series([1,"John",3.5,"Hey"])
obj

0       1
1    John
2     3.5
3     Hey
dtype: object

In [4]:
obj2=pd.Series([1,"John",3.5,"Hey"],index=["a","b","c","d"])
obj2

a       1
b    John
c     3.5
d     Hey
dtype: object

In [5]:
obj2["b"]

'John'

In [6]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [7]:
obj2.values

array([1, 'John', 3.5, 'Hey'], dtype=object)

In [8]:
score={"Jane":90, "Bill":80,"Elon":85,"Tom":75,"Tim":95}
names=pd.Series(score)
names

Jane    90
Bill    80
Elon    85
Tom     75
Tim     95
dtype: int64

In [9]:
names["Tim"]

np.int64(95)

In [10]:
names[names>=85]

Jane    90
Elon    85
Tim     95
dtype: int64

In [11]:
names["Tom"]=60
names

Jane    90
Bill    80
Elon    85
Tom     60
Tim     95
dtype: int64

In [12]:
names[names<=80]=83
names

Jane    90
Bill    83
Elon    85
Tom     83
Tim     95
dtype: int64

In [13]:
"Tom" in names

True

In [14]:
names**2

Jane    8100
Bill    6889
Elon    7225
Tom     6889
Tim     9025
dtype: int64

In [15]:
names.isnull()

Jane    False
Bill    False
Elon    False
Tom     False
Tim     False
dtype: bool

In [16]:
data={"name":["Bill","Tom","Tim","John","Alex","Vanessa","Kate"],      
      "score":[90,80,85,75,95,60,65],      
      "sport":["Wrestling","Football","Skiing","Swimming","Tennis",
               "Karete","Surfing"],      
      "sex":["M","M","M","M","F","F","F"]}

DATA FRAMES

In [17]:
df=pd.DataFrame(data)
df

      name  score      sport sex
0     Bill     90  Wrestling   M
1      Tom     80   Football   M
2      Tim     85     Skiing   M
3     John     75   Swimming   M
4     Alex     95     Tennis   F
5  Vanessa     60     Karete   F
6     Kate     65    Surfing   F

In [18]:
df=pd.DataFrame(data,columns=["name", "sport", "gender", "score", "age"],
                index=["one","two","three","four","five","six","seven"])
df

          name      sport gender  score  age
one       Bill  Wrestling    NaN     90  NaN
two        Tom   Football    NaN     80  NaN
three      Tim     Skiing    NaN     85  NaN
four      John   Swimming    NaN     75  NaN
five      Alex     Tennis    NaN     95  NaN
six    Vanessa     Karete    NaN     60  NaN
seven     Kate    Surfing    NaN     65  NaN

In [19]:
df.head()

       name      sport gender  score  age
one    Bill  Wrestling    NaN     90  NaN
two     Tom   Football    NaN     80  NaN
three   Tim     Skiing    NaN     85  NaN
four   John   Swimming    NaN     75  NaN
five   Alex     Tennis    NaN     95  NaN

In [20]:
df.tail()

          name     sport gender  score  age
three      Tim    Skiing    NaN     85  NaN
four      John  Swimming    NaN     75  NaN
five      Alex    Tennis    NaN     95  NaN
six    Vanessa    Karete    NaN     60  NaN
seven     Kate   Surfing    NaN     65  NaN

In [21]:
df["sport"]

one      Wrestling
two       Football
three       Skiing
four      Swimming
five        Tennis
six         Karete
seven      Surfing
Name: sport, dtype: object

In [22]:
my_columns=["name","sport"]
df[my_columns]

          name      sport
one       Bill  Wrestling
two        Tom   Football
three      Tim     Skiing
four      John   Swimming
five      Alex     Tennis
six    Vanessa     Karete
seven     Kate    Surfing

In [23]:
df.loc[["one"]]

     name      sport gender  score  age
one  Bill  Wrestling    NaN     90  NaN

In [24]:
df.loc[["one","two"],["name"]]

     name
one  Bill
two   Tom

In [25]:
df=pd.DataFrame(data,columns=["name", "sport", "gender", "score", "age"], 
                index=["one","two","three","four","five","six","seven"])
values=[18,19,20,18,17,17,18]
df["age"]=values
df

          name      sport gender  score  age
one       Bill  Wrestling    NaN     90   18
two        Tom   Football    NaN     80   19
three      Tim     Skiing    NaN     85   20
four      John   Swimming    NaN     75   18
five      Alex     Tennis    NaN     95   17
six    Vanessa     Karete    NaN     60   17
seven     Kate    Surfing    NaN     65   18

FILTERING

In [26]:
df["pass"]=df.score>=70
df

          name      sport gender  score  age   pass
one       Bill  Wrestling    NaN     90   18   True
two        Tom   Football    NaN     80   19   True
three      Tim     Skiing    NaN     85   20   True
four      John   Swimming    NaN     75   18   True
five      Alex     Tennis    NaN     95   17   True
six    Vanessa     Karete    NaN     60   17  False
seven     Kate    Surfing    NaN     65   18  False

In [27]:
df.iloc[1:4,1:3]

          sport gender
two    Football    NaN
three    Skiing    NaN
four   Swimming    NaN

In [28]:
df

          name      sport gender  score  age   pass
one       Bill  Wrestling    NaN     90   18   True
two        Tom   Football    NaN     80   19   True
three      Tim     Skiing    NaN     85   20   True
four      John   Swimming    NaN     75   18   True
five      Alex     Tennis    NaN     95   17   True
six    Vanessa     Karete    NaN     60   17  False
seven     Kate    Surfing    NaN     65   18  False

In [29]:
# reindex
# drop
# mean
#arthimetic ,statistical operations

In [30]:
f=lambda x:x.max()-x.min()
df[["score"]].apply(f)

score    35
dtype: int64

In [31]:
df.sort_index(axis=1, ascending=False)

           sport  score   pass     name gender  age
one    Wrestling     90   True     Bill    NaN   18
two     Football     80   True      Tom    NaN   19
three     Skiing     85   True      Tim    NaN   20
four    Swimming     75   True     John    NaN   18
five      Tennis     95   True     Alex    NaN   17
six       Karete     60  False  Vanessa    NaN   17
seven    Surfing     65  False     Kate    NaN   18

In [32]:
df["age"].sort_values(axis=0, ascending=False)

three    20
two      19
one      18
four     18
seven    18
five     17
six      17
Name: age, dtype: int64

In [33]:
df["age"].isnull()

one      False
two      False
three    False
four     False
five     False
six      False
seven    False
Name: age, dtype: bool

In [34]:
df["age"].notnull()

one      True
two      True
three    True
four     True
five     True
six      True
seven    True
Name: age, dtype: bool

In [35]:
df2 = df.copy()
df2["gender"][0:2] = ["M","F"]

In [36]:
df2

          name      sport gender  score  age   pass
one       Bill  Wrestling      M     90   18   True
two        Tom   Football      F     80   19   True
three      Tim     Skiing    NaN     85   20   True
four      John   Swimming    NaN     75   18   True
five      Alex     Tennis    NaN     95   17   True
six    Vanessa     Karete    NaN     60   17  False
seven     Kate    Surfing    NaN     65   18  False

In [37]:
# df2.dropna(inplace=True)

In [38]:
df2.fillna(0, inplace=True)

In [39]:
df2

          name      sport gender  score  age   pass
one       Bill  Wrestling      M     90   18   True
two        Tom   Football      F     80   19   True
three      Tim     Skiing      0     85   20   True
four      John   Swimming      0     75   18   True
five      Alex     Tennis      0     95   17   True
six    Vanessa     Karete      0     60   17  False
seven     Kate    Surfing      0     65   18  False

In [40]:
d1=pd.DataFrame(
    {"key":["a","b","c","c","d","e"],
     "num1":range(6)})
d2=pd.DataFrame(
    {"key":["b","c","e","f"],
     "num2":range(4)})

In [41]:
d1

  key  num1
0   a     0
1   b     1
2   c     2
3   c     3
4   d     4
5   e     5

In [42]:
d2

  key  num2
0   b     0
1   c     1
2   e     2
3   f     3

In [43]:
pd.merge(d1, d2)

  key  num1  num2
0   b     1     0
1   c     2     1
2   c     3     1
3   e     5     2

In [44]:
# pd.merge(d2, d1,on="key") #how

In [45]:
pd.concat([d1, d2], axis=1)

  key  num1  key  num2
0   a     0    b   0.0
1   b     1    c   1.0
2   c     2    e   2.0
3   c     3    f   3.0
4   d     4  NaN   NaN
5   e     5  NaN   NaN

In [46]:
pd.concat([d1, d2], axis=0)

  key  num1  num2
0   a   0.0   NaN
1   b   1.0   NaN
2   c   2.0   NaN
3   c   3.0   NaN
4   d   4.0   NaN
5   e   5.0   NaN
0   b   NaN   0.0
1   c   NaN   1.0
2   e   NaN   2.0
3   f   NaN   3.0